{
    "Theon Greyjoy": "Heir to the Iron Islands, taken as a ward by Eddard Stark after his father's failed rebellion.",
    "Tyrion Lannister": "Known as 'The Imp', Tyrion is clever and has a sharp wit, often using his intelligence to navigate the complex political landscape of Westeros.",
    "Sansa Stark": "Initially naive, Sansa grows into a strong and savvy political leader, learning from her hardships in King's Landing.",
    "Illyrio Mopatis": "A wealthy magister of Pentos who supports the Targaryen siblings, Daenerys and Viserys, with their ambitions to reclaim the Iron Throne.",
    "Septa Mordane": "Septa Mordane is responsible for the education of the Stark girls, teaching them etiquette and history.",
    "Robb Stark": "The eldest Stark son, Robb is declared King in the North and leads a rebellion against the Lannisters.",
    "Bran Stark": "After a fall that paralyzes his legs, Bran develops mystical powers and becomes the Three-Eyed Raven.",
    "Gared": "A member of the Night's Watch who is executed for desertion in the series' opening scenes.",
    "Eddard Stark": "Warden of the North and head of the Stark family, Eddard is known for his honor and integrity.",
    "Maid": "A background character serving various noble houses in the series.",
    "Catelyn Stark": "Matriarch of the Stark family, Catelyn is fiercely protective of her children and politically astute.",
    "Cersei Lannister": "Queen and later self-proclaimed ruler of the Seven Kingdoms, Cersei is known for her cunning, ruthlessness, and determination to protect her children.",
    "Sandor Clegane": "Known as 'The Hound', Sandor is a fearsome warrior with a deep-seated fear of fire.",
    "Jorah Mormont": "Exiled knight loyal to Daenerys Targaryen, Jorah serves as her advisor and protector.",
    "Maester Luwin": "A maester serving House Stark at Winterfell, Luwin provides counsel and serves as a mentor to the Stark children.",
    "Benjen Stark": "A member of the Night's Watch and the younger brother of Eddard Stark, Benjen's fate north of the Wall is shrouded in mystery.",
    "Khal Drogo": "A powerful warlord of the Dothraki people, Khal Drogo is married to Daenerys Targaryen as part of a political alliance.",
    "Ros": "A prostitute from Winterfell who rises to prominence in Littlefinger's establishments in King's Landing.",
    "Stark Guard": "Loyal soldiers who serve House Stark, protecting their lords at Winterfell and beyond.",
    "Waymar Royce": "A young nobleman of the Night's Watch who meets a grim fate beyond the Wall.",
    "Will": "A ranger of the Night's Watch who encounters the White Walkers and is executed for desertion.",
    "Jon Snow": "The illegitimate son of Eddard Stark raised at Winterfell, Jon eventually becomes Lord Commander of the Night's Watch and later King in the North.",
    "Arya Stark": "The youngest daughter of Eddard Stark, Arya is fiercely independent and trained as a Faceless Man in Braavos.",
    "Daenerys Targaryen": "The last surviving child of the Targaryen dynasty, Daenerys seeks to reclaim her family's throne, evolving from a timid girl into a powerful leader.",
    "Rodrik Cassel": "Master-at-Arms at Winterfell, Rodrik trains the Stark children in combat.",
    "Robert Baratheon": "The King of the Seven Kingdoms whose rebellion overthrew the Targaryens, Robert's death leads to widespread war and conflict.",
    "Jaime Lannister": "Known as the 'Kingslayer' for killing the previous king, Jaime is a complex character torn between family loyalty and a newfound sense of honor.",
    "Viserys Targaryen": "Daenerys's older brother, obsessed with reclaiming the Iron Throne, whose desperation leads to his downfall."
}
